# 구구 

'''
문제
구구 구구구 구구구 구구구구구구 구구구구 구구구구 구구구 구구구
구구구 구구구 구구구구구 구구구구 구구구 구구구구구구 구구
구구구 구구구 구구구구구 구구구구 구구 구구구구 구구구구구 구구구구
구 구구구구 구구구구 구 구구구구 구구 구구구구

구구 구구구구 구구구구구 구구구 구구구구구구구, 구구 구구구 구구구구구
구구 구 구구구구구 구구구구 구구구구구구 구구구 구구구구 구구구
구구구구 구구'구 구구구구구구 구구구구 구구구구구구구구
구구구구 구구구 구구구, 구'구구 구구구구 구 구구구구 구구 구구구구

구 구구구구구구구구 구구구구 구구구구구구구
구구구 구구구구구 구구구구 구구구구구구 구구구구 구구구구
구구구 구구 구구구구구 구구구구구구 구구 구구구구
구구구구 구구구구, 구구구 구구구구구 구구구구구구
구구구구 구구구구 구구구구 구구구구, "구구 구구구구"
구구구 구구 구구구구구 구구구구구구 구구 구구구구

구구 구구구 구구구 구구 구구구 구구 구구구 구구구구구구구
구구구 구구구 구구구구 구구구구 구구 구구구구 구구구구 구구구 구구구
구구 구구 구구구구구 구구구 구구구구 구구구구구구 구구구구
구 구구구구 구구구구 구 구구구구 구구 구구구구

구구구구구 구구구 구구구구 구구구구 구구구구 구구구구구구구구구
구구 구구구 구구구구, 구구구구구 구구구 구구 구구구구구구구
구구구구 구구 구구구구구 구구구구구구 구구구구 구구 구구구구구구
구구구구 구구구 구구구, 구'구구 구구구구 구 구구구구 구구 구구구구

입력
구구가 부른 노래가 입력으로 주어진다.

출력
구구가 부른 노래의 제목을 출력한다.
'''

print("Hymn To Love")

# 문제를 보자마자 인터넷 검색 말고는 답이 떠오르지 않았다
# 8년전에 작성된 댓글을 봐도 이해하긴 어려웠지만 재밌는 문제같다

''' 
79brue 8년 전

1. TEXT 12자, PHP 13자이다.
'여기에서 중점은 바로, 13B 제출이 가능하다는 것입니다.' 공백의 차이라고 합니다.
2. 아래의 피존 힌트는 구구가 비둘기의 울음소리이므로
비둘기 = pigeon, 즉 피존 힌트의 가사는 확실히 외국어이다.
(노래가 뭔지는 알겠는데, 답을 모르겠...)
3. 답은 알파벳이다.
'baekjoon님이 대소문자 구별된다고 했던 것을 보아, 알파벳인 것 같습니다.'
4. 위키백과에 가수 문서가 있고, 1915년에 태어난 사람이 1950년에 발매함.
'아직까진 저는 몰랐습니다.'
5. EP
'이게 무슨 이니셜 같아서 조사를 하다가 알아냈죠. 노래를...'
6. 문제를 약간 꼬은 듯. 피존의 노래 제목과는 답이 완전히 다르다.
예외라면 대소문자 때문에 틀렸을 지도...
7. 언어는 알 수 없다. 
'''